Tekla.Structures.Model.SpiralBeam
A class for the spiral beam part.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public bool SimpleExample()
{
var startPoint = new Point(0.0, 0.0, 0.0);
var centerPoint = new Point(200.0, 0.0, 0.0);
var totalRise = 100.0;
var rotationAngle = 90.0;
SpiralBeam spiral = new SpiralBeam(startPoint, centerPoint, totalRise, rotationAngle);
spiral.Profile.ProfileString = "U300";
return spiral.Insert();
}
public bool FullExample()
{
var startPoint = new Point(0.0, 0.0, 0.0);
var rotationAxisPoint1 = new Point(200.0, 0.0, 0.0);
var rotationAxisPoint2 = new Point(200.0, 0.0, 1000.0);
var totalRise = 1000.0;
var rotationAngle = 1080.0;
var twistAngleStart = 10.0;
var twistAngleEnd = 30.0;
SpiralBeam spiral = new SpiralBeam(startPoint, rotationAxisPoint1, rotationAxisPoint2, totalRise, rotationAngle, twistAngleStart, twistAngleEnd);
spiral.Profile.ProfileString = "HEA400";
spiral.Material.MaterialString = "Steel_Undefined";
bool result = spiral.Insert();
return result;
}
}

Tekla.Structures.Model.SpiralBeam.StartPoint
Gets or sets the start point of the spiral beam.

Tekla.Structures.Model.SpiralBeam.RotationAxisBasePoint
Gets or sets the first definition point of the spiral beam rotation axis.

Tekla.Structures.Model.SpiralBeam.RotationAxisUpPoint
Gets or sets the second definition point of the spiral beam rotation axis.

Tekla.Structures.Model.SpiralBeam.TotalRise
Gets or sets the difference between the spiral beam start and end point in the direction of the rotation axis.

Tekla.Structures.Model.SpiralBeam.RotationAngle
Gets or sets the rotation of the spiral beam in degrees. Each range of 360.0 degrees adds a full rotation.

Tekla.Structures.Model.SpiralBeam.TwistAngleStart
Gets or sets the twist angle in degrees at the start of the spiral beam.

Tekla.Structures.Model.SpiralBeam.TwistAngleEnd
Gets or sets the twist angle in degrees at the end of the spiral beam.

Tekla.Structures.Model.SpiralBeam.RotationCenterPoint
Gets the geometric rotation center point at the start of the spiral beam.

Tekla.Structures.Model.SpiralBeam.RotationAxisDirection
Gets the direction of the spiral beam rotation axis.

Tekla.Structures.Model.SpiralBeam.EndPoint
Gets the spiral beam end point.

Tekla.Structures.Model.SpiralBeam.#ctor
Initializes a new instance of the Tekla.Structures.Model.SpiralBeam class.

Tekla.Structures.Model.SpiralBeam.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.Model.SpiralBeam class with the given parameters.
startPoint: The spiral beam starting point.
rotationAxisBasePoint: The first definition point of the spiral beam rotation axis.
rotationAxisUpPoint: The second definition point of the spiral beam rotation axis.
totalRise: The difference between the spiral beam start and end point along the rotation axis direction.
rotationAngle: The spiral beam cumulative rotation angle.
twistAngleAtStart: The twist angle at the start of the spiral beam.
twistAngleAtEnd: The twist angle at the end of the spiral beam.

Tekla.Structures.Model.SpiralBeam.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.Model.SpiralBeam class with the given parameters.
startPoint: The spiral beam starting point.
rotationAxisBasePoint: The first definition point of the spiral beam rotation axis.
rotationAxisUpPoint: The second definition point of the spiral beam rotation axis.
totalRise: The difference between the spiral beam start and end point along the rotation axis direction.
rotationAngle: The spiral beam cumulative rotation angle.

Tekla.Structures.Model.SpiralBeam.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.Model.SpiralBeam class with the given parameters. Rotation axis direction is current positive Z direction.
startPoint: The spiral beam starting point.
rotationAxisPoint: A point on the spiral beam rotation axis.
totalRise: The difference between the spiral beam start and end point along the rotation axis direction.
rotationAngle: The spiral beam cumulative rotation angle.

Tekla.Structures.Model.SpiralBeam.Insert
Inserts the spiral beam into the model database. All the attributes must be set.
Throws Tekla.Structures.Model.SpiralBeamDataException: Throws exception if input data is invalid.
Returns: True on success.

Tekla.Structures.Model.SpiralBeam.Select
Selects a spiral beam object from the database.
Returns: True if success

Tekla.Structures.Model.SpiralBeam.Delete
Deletes the spiral beam with this instance identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.SpiralBeam.Modify
Modifies the spiral beam object values in the database.
Throws Tekla.Structures.Model.SpiralBeamDataException: Throws exception if input data is invalid.
Returns: True if success

Tekla.Structures.Model.SpiralBeam.ToStruct(Tekla.Structures.ModelInternal.dotPart_t@)
Exports this to marshaling struct
p: the export struct

Tekla.Structures.Model.SpiralBeam.FromStruct(Tekla.Structures.ModelInternal.dotPart_t@)
Import this from marshaling struct
p: the export struct

Tekla.Structures.Model.SpiralBeam.Geometry
Gets or sets the geometry of the spiral beam.

Tekla.Structures.Model.SpiralBeam.SpiralBeamParametersCheck
Examines whether the spiral beam parameters are well defined.

Tekla.Structures.Model.SpiralBeam.SelectInstance
Selects an instance of a spiral beam.
Returns: True if success

Tekla.Structures.Model.SpiralBeam.CreateInstance
Creates an instance of a spiral beam.
Throws Tekla.Structures.Model.SpiralBeamDataException: Throws exception if input data is invalid.
Returns: True if success

Tekla.Structures.Model.SpiralBeam.ModifyInstance
Modifies an instance of a spiral beam.
Throws Tekla.Structures.Model.SpiralBeamDataException: Throws exception if input data is invalid.
Returns: True if success